{"/getting-started":{"title":"Instalação","data":{"":"Siga as seguintes instruções para instalar e executar o projeto.","instalação-local#Instalação local":"","download#Download":"Faça o download do arquivo compose.yaml neste link e armazene-o em um diretório vazio.","execução-com-docker-compose#Execução com Docker Compose":"Execute o comando abaixo no terminal do diretório em que o arquivo compose.yaml foi armazenado:\ndocker compose up"}},"/endpoints":{"title":"Endpoints da API","data":{"":"A API oferece endpoints de autenticação e de consulta de dados.","swagger#Swagger":"A documentação dos endpoints da API foi desenvolvida com Swagger e Scalar e pode ser acessada nesse link.","lista-de-endpoints#Lista de endpoints":"","registrar-usuário#Registrar usuário":"Endpoint: POST /registrar\nDescrição: endpoint de criação de novos usuários.","fazer-login#Fazer login":"Endpoint: POST /login\nDescrição: endpoint de autenticação para usuários existentes.\nA autenticação é realizada com email e senha. Esse endpoint retorna um token JWT que deve ser usado nas requisições ao endpoint de consulta de dados.","consultar-dados#Consultar dados":"Endpoint: GET /consulta\nDescrição: endpoint de consulta de manchetes.\nEsse endpoint retorna uma lista de manchetes da BBC. Essas manchetes são armazenadas em cache (memória) e atualizam de hora em hora."}},"/":{"title":"Introdução","data":{"":"Esse projeto foi desenvolvido para a disciplina de Computação em Nuvem e demonstra uma API de autenticação com JWTs (JSON Web Tokens) que foi desenvolvida com ElysiaJS, Bun e TypeScript.","tecnologias-utilizadas#Tecnologias utilizadas":"Foram utilizadas as seguintes tecnologias:\nElysiaJS: framework para construir servidores web\nBun: runtime de JavaScript e package manager\nTypeScript: linguagem de programação com tipagem estática\nPrisma: ORM para Node.js e TypeScript\nE as seguintes bibliotecas foram utilizadas para desenvolver o serviço de web scraping:\nCheerio: biblioteca para parsing de HTML\nAxios: cliente HTTP para fazer requisições web","endpoints-da-api#Endpoints da API":"A API oferece endpoints de autenticação e de consulta de dados. Acesse a documentação da API para visualizar a lista de endpoints."}}}